# 定义：能装东西的东西
# python中用[]来表示列表，列表里面的元素用“,”隔开,列表里面的元素可以重复

# 特性，列表也可以进行索引和切片
lst = ['金毛狮王', '张无忌', '周杰伦', '周润发']
print(lst[0])
print(lst[1:3])
print(lst[::-1])
for item in lst:
    print(item)
print(len(lst))  # 用len()函数可以拿到列表的长度

# -----------------------------------------------------------------------------------------------------------------------
# 列表的增删改查
lst = []
print(lst)
# 向列表中添加内容
# append()追加
lst.append("肖顺康")
lst.append("赵本山")
lst.append("周杰伦")
lst.append("赵本山")
print(lst)
# insert()插入
lst.insert(0, "孝顺看")
print(lst)
# extend()可以合并两个列表，可以进行批量地添加
lst.extend(["xsk", "zrf", "zjl"])
print(lst)

# -----------------------------------------------------------------------------------------------------------------------
# 删除
lst.pop(3)  # pop接受的参数是一个索引，返回值的为被删除的元素
print(lst)
lst.remove("xsk")  # 删除某个元素

# 修改,直接用索引可以进行修改
lst[2] = "周星驰"
print(lst)

# 查询,直接用索引进行查询
print(lst[2])

# 练习
# 将列表里面的人员的名字改为以“肖”开头
lst1 = ['孝顺看', '肖顺康', '周星驰', '赵本山', '列表']
for i in range(len(lst1)):
    item = lst1[i]
    if not item.startswith("肖"):
        item = "肖" + item[1:]
        lst1[i] = item
print(lst1)

# -----------------------------------------------------------------------------------------------------------------------
# 列表会按照你放的数据的顺序来保存
lst = [123, 234, 345, 456, 678, 789]
print(lst)
lst.sort()  # 对列表进行升序排序
lst.sort(reverse=True)  # 对列表进行降序排序,reverse表示是否翻转
print(lst)

# -----------------------------------------------------------------------------------------------------------------------
# 列表的循环删除
lst = ['赵敏', '张22', '张三三', '张44', '诸葛亮', '马超']
for item in lst:
    if item.startswith("张"):
        lst.remove(item)
print(lst)  # 这样的话，张三三删除不了，因为列表的下一个元素会自动的来补齐

# 安全稳妥的方式
lst = ['赵敏', '张22', '张三三', '张44', '诸葛亮', '马超']
temp = []
for item in lst:
    if item.startswith("张"):
        temp.append(item)
for i in temp:
    lst.remove(i)
print(lst)
